---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalService.ExternalServiceOptions
source: html/d6b44483-99a4-3b5a-bf6b-47311c8c12fd.htm
---
# ExternalServiceOptions Members

Constructs a new ExternalServiceOptions with default settings.